'use client'

import Background from '@/components/Background'
import Header from '@/components/Header'
import Footer from '@/components/Footer'

import { useTheme } from '@emotion/react'
import {
    Box,
    Card,
    Typography,
    Container,
    Grid,
    Toolbar,
    TopAppBarFixedAdjust,
    CardContent,
    Stack,
    SvgIcon,
    CardMedia,
    Button,
} from '@mui/material'

const svg = (
    <svg
        width="56"
        height="56"
        viewBox="0 0 56 56"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
    >
        <rect width="56" height="56" rx="16" fill="#E1F4D9" />
        <g clipPath="url(#clip0_893_81)">
            <path
                d="M20 26.5C16.416 26.5 13.5 23.584 13.5 20C13.5 16.416 16.416 13.5 20 13.5C23.584 13.5 26.5 16.416 26.5 20C26.5 23.584 23.584 26.5 20 26.5ZM37 28.5C35.0705 28.5 33.5 26.93 33.5 25C33.5 23.07 35.0705 21.5 37 21.5C38.9295 21.5 40.5 23.07 40.5 25C40.5 26.93 38.9295 28.5 37 28.5ZM37 24C36.4485 24 36 24.4485 36 25C36 25.5515 36.4485 26 37 26C37.5515 26 38 25.5515 38 25C38 24.4485 37.5515 24 37 24Z"
                fill="#66BB6A"
            />
            <path
                d="M18.5001 29.5H19.5001V30.5H18.5001V29.5ZM23.8716 17.8345L23.1286 17.1655L19.0226 21.7275L17.3906 19.6875L16.6096 20.3125L18.9776 23.2725L23.8716 17.8345Z"
                fill="#151716"
            />
            <path
                d="M43.5 30.7171C43.5014 29.4058 43.2153 28.1102 42.6619 26.9214C42.1085 25.7327 41.3013 24.6797 40.297 23.8366C40.426 24.2016 40.5 24.5916 40.5 25.0001C40.5 25.1386 40.49 25.2741 40.474 25.4081C41.7789 26.8685 42.5002 28.7585 42.5 30.7171C42.5 36.1116 38.1115 40.5001 32.717 40.5001H29.89L29.64 39.5001H32C32.5515 39.5001 33 39.0516 33 38.5001V38.4866C37.1585 38.3456 40.5 34.9281 40.5 30.7361V30.6216C40.5 29.4831 40.1505 28.3686 39.509 27.4351C39.2751 27.6763 39.0077 27.8826 38.715 28.0476C39.2255 28.8088 39.4987 29.7045 39.5 30.6211V30.7356C39.5 34.3766 36.6065 37.3466 32.9985 37.4861C32.9948 37.2235 32.8881 36.973 32.7012 36.7885C32.5144 36.604 32.2625 36.5004 32 36.5001H27.366L26.4315 30.6591C26.566 30.7231 26.708 30.7676 26.8565 30.7676C27.0291 30.7676 27.1988 30.7229 27.349 30.6378C27.4992 30.5527 27.6248 30.4301 27.7135 30.2821L28.548 28.8916L29.221 29.3271L28.3035 30.8566C28.1756 31.0686 28.1312 31.3206 28.1788 31.5636C28.2265 31.8066 28.3629 32.0231 28.5615 32.1711L29.757 33.0681C29.8691 33.152 29.9975 33.2115 30.134 33.2427C30.2705 33.274 30.4121 33.2763 30.5495 33.2496C30.6869 33.2226 30.817 33.1671 30.9316 33.0867C31.0461 33.0062 31.1425 32.9026 31.2145 32.7826L32.1505 31.2226L32.815 31.6526C33.0358 31.7949 33.3037 31.8448 33.561 31.7914C33.8182 31.738 34.0441 31.5856 34.19 31.3671L34.6355 30.6996C34.7699 30.5001 34.8271 30.2586 34.7965 30.0201C34.766 29.7815 34.6498 29.5622 34.4695 29.4031L35.3145 28.0656C35.02 27.903 34.7504 27.6989 34.514 27.4596L33.638 28.8466L27.259 24.7186L32.169 16.6841L38.805 20.6656L38.1525 21.6986C38.47 21.8095 38.7697 21.9658 39.0425 22.1626L39.6515 21.1986C39.7229 21.086 39.7709 20.9602 39.7926 20.8287C39.8143 20.6972 39.8094 20.5626 39.778 20.4331C39.7475 20.3034 39.6912 20.1813 39.6125 20.0738C39.5338 19.9663 39.4344 19.8758 39.32 19.8076L38.2325 19.1551L38.5485 18.5226L38.864 18.7066C39.076 18.8299 39.3258 18.8712 39.5662 18.8226C39.8066 18.7739 40.0207 18.6387 40.168 18.4426L41.064 17.2481C41.1486 17.1352 41.2084 17.0057 41.2394 16.8682C41.2704 16.7306 41.272 16.588 41.2441 16.4497C41.2161 16.3115 41.1593 16.1807 41.0772 16.066C40.9952 15.9513 40.8898 15.8552 40.768 15.7841L35.6365 12.7926C35.4247 12.6689 35.1749 12.6275 34.9346 12.6761C34.6942 12.7247 34.4801 12.8599 34.333 13.0561L33.437 14.2506C33.3524 14.3634 33.2926 14.4929 33.2616 14.6305C33.2306 14.7681 33.229 14.9107 33.2569 15.0489C33.2849 15.1871 33.3417 15.3179 33.4238 15.4326C33.5058 15.5474 33.6112 15.6434 33.733 15.7146L34.0675 15.9101L33.681 16.4256L32.6825 15.8266C32.4561 15.6916 32.1856 15.6511 31.9296 15.714C31.6736 15.7769 31.4526 15.938 31.3145 16.1626L26.8085 23.5356C26.7072 23.5132 26.6038 23.5013 26.5 23.5001H25.4685C25.2387 23.8583 24.9745 24.1933 24.6795 24.5001H25.42C25.3798 24.5412 25.3432 24.5857 25.3105 24.6331L24.865 25.3006C24.715 25.5251 24.663 25.7946 24.718 26.0586C24.7725 26.3226 24.9275 26.5486 25.154 26.6946L25.619 26.9956L25.3165 27.5001H14C13.724 27.5001 13.5 27.2756 13.5 27.0001V25.0001C13.5 24.7246 13.724 24.5001 14 24.5001H15.3205C15.0255 24.1933 14.7613 23.8583 14.5315 23.5001H14C13.173 23.5001 12.5 24.1731 12.5 25.0001V27.0001C12.5 27.8271 13.173 28.5001 14 28.5001H14.4135L12.5355 40.2386C12.4716 40.6408 12.4956 41.0522 12.6058 41.4443C12.7161 41.8364 12.9101 42.2 13.1743 42.5099C13.4386 42.8199 13.7669 43.0689 14.1366 43.2398C14.5063 43.4108 14.9087 43.4996 15.316 43.5001H32C32.5515 43.5001 33 43.0516 33 42.5001V41.5001C33 41.4951 32.9985 41.4906 32.9985 41.4856C38.8135 41.3346 43.5 36.5676 43.5 30.7171ZM35.133 13.6566L40.2635 16.6491L39.3675 17.8441L34.237 14.8511L35.133 13.6566ZM34.937 16.4171L37.682 18.0181L37.3715 18.6391L34.5435 16.9421L34.937 16.4171ZM32 37.5001L32.0005 38.5001H21V37.5001H32ZM28.61 39.5001L28.86 40.5001H24.14L24.39 39.5001H28.61ZM30.3565 32.2676L29.1605 31.3706L30.061 29.8701L31.31 30.6786L30.3565 32.2676ZM26.142 25.1876L33.8025 30.1446L33.357 30.8126L25.697 25.8556L26.142 25.1876ZM26.459 27.5396L27.708 28.3476L26.8565 29.7676L25.6605 28.8706L26.459 27.5396ZM15.316 42.5001C15.0534 42.4997 14.7939 42.4424 14.5555 42.3322C14.3172 42.222 14.1055 42.0614 13.9351 41.8616C13.7647 41.6617 13.6396 41.4273 13.5685 41.1745C13.4973 40.9217 13.4818 40.6565 13.523 40.3971L14.1465 36.5001H18V35.5001H14.3065L14.6265 33.5001H19.5V32.5001H14.7865L15.1065 30.5001H17.5V29.5001H15.2665L15.4265 28.5001H24.7345C24.652 28.7039 24.6394 28.9293 24.6985 29.141C24.7577 29.3528 24.8853 29.539 25.0615 29.6706L25.289 29.8411L26.3535 36.5001H21C20.4485 36.5001 20 36.9486 20 37.5001V38.5001C20 39.0516 20.4485 39.5001 21 39.5001H23.36L23.11 40.5001H21C20.4485 40.5001 20 40.9486 20 41.5001V42.5001H15.316ZM21.5 42.5001H21V41.5001H32L32.0005 42.5001H21.5Z"
                fill="#151716"
            />
            <path
                d="M37 23.5C36.173 23.5 35.5 24.173 35.5 25C35.5 25.827 36.173 26.5 37 26.5C37.827 26.5 38.5 25.827 38.5 25C38.5 24.173 37.827 23.5 37 23.5ZM37 25.5C36.8713 25.4942 36.7497 25.439 36.6606 25.3459C36.5716 25.2528 36.5219 25.1289 36.5219 25C36.5219 24.8711 36.5716 24.7472 36.6606 24.6541C36.7497 24.561 36.8713 24.5058 37 24.5C37.1287 24.5058 37.2503 24.561 37.3394 24.6541C37.4284 24.7472 37.4781 24.8711 37.4781 25C37.4781 25.1289 37.4284 25.2528 37.3394 25.3459C37.2503 25.439 37.1287 25.4942 37 25.5Z"
                fill="#151716"
            />
        </g>
        <defs>
            <clipPath id="clip0_893_81">
                <rect
                    width="56"
                    height="56"
                    fill="white"
                    transform="translate(12 12)"
                />
            </clipPath>
        </defs>
    </svg>
)

const cards = [
    {
        svg: svg,
        title: 'Інноваційні дослідження та навчання',
        abstract:
            'Наші лабораторії оснащені сучасною технікою, що дозволяє проводити передові наукові дослідження та навчати за інноваційними програмами.',
    },
    {
        svg: svg,
        title: 'Міжнародна співпраця',
        abstract:
            'Співпраця з провідними університетами світу дає можливість нашим студентам брати участь у міжнародних обмінах, стажуваннях та спільних проектах.',
    },
    {
        svg: svg,
        title: 'Професійний розвиток ',
        abstract:
            'Студенти отримують практичні навички через стажування та практики завдяки тісній співпраці з аграрними підприємствами та ІТ-компаніями.',
    },
    {
        svg: svg,
        title: 'Сучасні технологій',
        abstract:
            'Ми використовуємо найновіші інструменти для моніторингу та управління агробізнесом, такі як дрони, сенсори для ґрунту та геоінформаційні системи.',
    },
    {
        svg: svg,
        title: 'Підтримка та менторство',
        abstract:
            'Досвідчені викладачі надають індивідуальне менторство, допомагаючи студентам розвивати навички та реалізовувати проекти',
    },
    {
        svg: svg,
        title: 'Працевлаштування випускників',
        abstract:
            'Наші випускники користуються високим попитом на ринку праці, знаходячи роботу в провідних аграрних та ІТ-компаніях.',
    },
]

const AboutCard = (card) => {
    return (
        <Card
            elevation={0}
            sx={{ padding: 0, height: '100%', bgcolor: 'transparent' }}
        >
            <CardContent sx={{ height: '100%', p: 3 }}>
                <Stack spacing={2} sx={{ display: 'flex', height: '100%' }}>
                    <SvgIcon sx={{ width: 56, height: 56 }}>{card.svg}</SvgIcon>
                    <Typography variant="h6" sx={{ flexGrow: 1 }}>
                        {card.title}
                    </Typography>
                    <Typography>{card.abstract}</Typography>
                </Stack>
            </CardContent>
        </Card>
    )
}

const firstColumnPhotos = [
    { src: '/team/firstColumn/1.png', alt: '' },
    { src: '/team/firstColumn/2.png', alt: '' },
    { src: '/team/firstColumn/3.png', alt: '' },
    { src: '/team/firstColumn/4.png', alt: '' },
]
const secondColumnPhotos = [
    { src: '/team/secondColumn/1.png', alt: '' },
    { src: '/team/secondColumn/2.png', alt: '' },
    { src: '/team/secondColumn/3.png', alt: '' },
    { src: '/team/secondColumn/4.png', alt: '' },
]

const PhotoColumn = (photo) => {
    return (
        <Box
            borderRadius={4}
            component="img"
            src={photo.src}
            alt={photo.alt}
            width="100%"
            height="100%"
            sx={{ objectFit: 'cover' }}
        ></Box>
    )
}

const professors = [
    {
        img: '/team/professors/1.png',
        alt: "professor's picture",
        id: 1,
        title: 'Завідувач кафедри,',
        degree: 'д.т.н., професор Іванов О.П.',
        abstract:
            'Педагогічний стаж - понад 20 років, Коло наукових інтересів - використання інноваційних технологій в садівництві...',
    },
    {
        img: '/team/professors/2.png',
        alt: "professor's picture",
        id: 2,
        title: 'Професорка кафедри,',
        degree: 'к.т.н.,  Іванова І.І.',
        abstract:
            'Педагогічний стаж -  15 років, Коло наукових інтересів - використання інноваційних технологій в садівництві...',
    },
    {
        img: '/team/professors/3.png',
        alt: "professor's picture",
        id: 3,
        title: 'Ще одна професорка кафедри,',
        degree: 'к.т.н.,  Іванова І.І.',
        abstract:
            'Педагогічний стаж -  15 років, Коло наукових інтересів - використання інноваційних технологій в садівництві...',
    },
]

const ProfessorCard = (card) => {
    return (
        <Grid container alignItems="stretch">
            <Grid item md={4} pr={4}>
                <Box
                    component="img"
                    alt={card.alt}
                    src={card.img}
                    width="100%"
                    height="100%"
                    sx={{ objectFit: 'cover' }}
                ></Box>
            </Grid>
            <Grid item md={8}>
                <Box>
                    <Typography
                        variant="h6"
                        color="primary.dark"
                        sx={{ flexGrow: 1 }}
                    >
                        {card.title}
                    </Typography>
                    <Typography variant="h6">{card.degree}</Typography>
                    <Typography>{card.abstract}</Typography>
                    <Box
                        textAlign="center"
                        sx={{ mt: { xs: 0, lg: 7, xl: 12 } }}
                    >
                        <Button variant="outlined" href={`/team/${card.id}`}>
                            Читати далі
                        </Button>
                    </Box>
                </Box>
            </Grid>
        </Grid>
    )
}

export default function Team() {
    const theme = useTheme()

    return (
        <>
            <Background />
            <Header />
            {
                <Box
                    component="main"
                    sx={{
                        flexGrow: 1,
                        fontSize: 48,
                    }}
                >
                    <Container maxWidth="xl">
                        <Box
                            component="section"
                            sx={{ mt: 13 }}
                            textAlign="center"
                        >
                            <Typography component="h2" fontSize="24px">
                                Про{' '}
                                <span
                                    style={{
                                        color: theme.palette.primary.dark,
                                    }}
                                >
                                    кафедру
                                </span>{' '}
                            </Typography>
                            <Typography fontSize="16px">
                                Про кафедру Інноваційні дослідження, міжнародна
                                співпраця, сучасні технології підготовки
                                фахівців
                            </Typography>
                        </Box>
                        <Grid
                            container
                            component="section"
                            spacing={2}
                            alignItems="stretch"
                        >
                            <Grid
                                item
                                xl={6}
                                lg={6}
                                md={8}
                                sm={12}
                                xs={12}
                                display="flex"
                                flexDirection="column"
                                gap={2}
                                sx={{ my: 10 }}
                            >
                                <Stack
                                    spacing={2}
                                    sx={{ display: 'flex', height: '100%' }}
                                >
                                    {cards.map((card) => (
                                        <AboutCard key={card.title} {...card} />
                                    ))}
                                </Stack>
                            </Grid>
                            <Grid
                                item
                                xl={3}
                                lg={3}
                                md={4}
                                display="flex"
                                flexDirection="column"
                                gap={2}
                                sx={{
                                    my: 10,
                                    display: {
                                        md: 'block',
                                        xs: 'none',
                                    },
                                }}
                            >
                                <Stack
                                    spacing={2}
                                    sx={{ display: 'flex', height: '100%' }}
                                >
                                    {firstColumnPhotos.map((photo) => (
                                        <PhotoColumn
                                            key={photo.src}
                                            {...photo}
                                        />
                                    ))}
                                </Stack>
                            </Grid>
                            <Grid
                                item
                                xl={3}
                                lg={3}
                                md={3}
                                display="flex"
                                flexDirection="column"
                                gap={2}
                                sx={{
                                    my: 10,
                                    display: { lg: 'block', xs: 'none' },
                                }}
                            >
                                <Stack
                                    spacing={2}
                                    sx={{ display: 'flex', height: '100%' }}
                                >
                                    {secondColumnPhotos.map((photo) => (
                                        <PhotoColumn
                                            key={photo.src}
                                            {...photo}
                                        />
                                    ))}
                                </Stack>
                            </Grid>
                        </Grid>
                        <Box
                            component="section"
                            sx={{ mt: 13 }}
                            textAlign="center"
                        >
                            <Typography component="h3" fontSize="24px">
                                Науковий колектив...
                            </Typography>
                        </Box>
                        <Stack
                            spacing={4}
                            sx={{ display: 'flex', height: '100%', my: 7 }}
                        >
                            {professors.map((professor) => (
                                <ProfessorCard
                                    key={professor.title}
                                    {...professor}
                                />
                            ))}
                        </Stack>
                    </Container>
                </Box>
            }
            <Footer />
        </>
    )
}
